In [45]:
import pandas as pd
from datetime import datetime

Abre uma planilha onde lê os dados dos clientes contidos na primeira página da mesma.

In [83]:
df_clients = pd.read_excel('dados/client_data_test.xlsx', sheet_name='Página1')

Apresentando a tabela atual.

In [84]:
df_clients

       Nome             CPF Data de Nascimento  Idade
0    Fulano  121.485.390-00         1962-01-25    NaN
1   Cicrano  272.301.120-87         1981-10-18    NaN
2  Deltrano     09602833076         1956-06-07    NaN

Renomeando as colunas para um formato padronizado: titulos das colunas em minusculo e sem espaços.

In [85]:
columns_renamed=[]
for column in df_clients:
    column_title=column.lower()
    column_title=column_title.replace(' ','_')
    columns_renamed.append(column_title)
df_clients.columns = columns_renamed

Apresentando a tabela com as colunas padronizadas.

In [86]:
df_clients

       nome             cpf data_de_nascimento  idade
0    Fulano  121.485.390-00         1962-01-25    NaN
1   Cicrano  272.301.120-87         1981-10-18    NaN
2  Deltrano     09602833076         1956-06-07    NaN

Agora será pego somente a coluna 'data_de_nascimento' para fazer o tratamento da idade a seguir.

In [87]:
date_birth = df_clients['data_de_nascimento']

O código a seguir irá fazer o calculo baseado na data atual para determinar a idade de cada cliente e armazenar na coluna 'idade'.

In [88]:
today = datetime.today()
df_clients['idade'] = (today - df_clients['data_de_nascimento']).dt.days//365

Apresentando a tabela atualizada com a idade de cada cliente

In [89]:
df_clients

       nome             cpf data_de_nascimento  idade
0    Fulano  121.485.390-00         1962-01-25     62
1   Cicrano  272.301.120-87         1981-10-18     42
2  Deltrano     09602833076         1956-06-07     67

Pra finalizar, salvando a tabela atualizada em um novo arquivo e mantendo o mesmo formato (xlsx).

In [ ]:
df_clients.to_excel('dados/client_data_att.xlsx')